define(["esri/layers/GeoJSONLayer", "esri/Map", "esri/views/MapView", "esri/Basemap", "esri/layers/TileLayer", "esri/widgets/Home", "esri/widgets/Legend", "esri/widgets/Expand", "esri/core/watchUtils", "dojo/domReady!"], (function (e, t, l, a, i, o, n, r, s, p) {
    return function (e) {
        function t(t) {
            for (var l, i, o = t[0], n = t[1], r = 0, p = []; r < o.length; r++) i = o[r], Object.prototype.hasOwnProperty.call(a, i) && a[i] && p.push(a[i][0]), a[i] = 0;
            for (l in n) Object.prototype.hasOwnProperty.call(n, l) && (e[l] = n[l]);
            for (s && s(t); p.length;) p.shift()()
        }

        var l = {}, a = {0: 0};

        function i(t) {
            if (l[t]) return l[t].exports;
            var a = l[t] = {i: t, l: !1, exports: {}};
            return e[t].call(a.exports, a, a.exports, i), a.l = !0, a.exports
        }

        i.m = e, i.c = l, i.d = function (e, t, l) {
            i.o(e, t) || Object.defineProperty(e, t, {enumerable: !0, get: l})
        }, i.r = function (e) {
            "undefined" != typeof Symbol && Symbol.toStringTag && Object.defineProperty(e, Symbol.toStringTag, {value: "Module"}), Object.defineProperty(e, "__esModule", {value: !0})
        }, i.t = function (e, t) {
            if (1 & t && (e = i(e)), 8 & t) return e;
            if (4 & t && "object" == typeof e && e && e.__esModule) return e;
            var l = Object.create(null);
            if (i.r(l), Object.defineProperty(l, "default", {
                enumerable: !0,
                value: e
            }), 2 & t && "string" != typeof e) for (var a in e) i.d(l, a, function (t) {
                return e[t]
            }.bind(null, a));
            return l
        }, i.n = function (e) {
            var t = e && e.__esModule ? function () {
                return e.default
            } : function () {
                return e
            };
            return i.d(t, "a", t), t
        }, i.o = function (e, t) {
            return Object.prototype.hasOwnProperty.call(e, t)
        }, i.p = "/", i.oe = function (e) {
            throw console.error(e), e
        };
        var o = window.webpackJsonp = window.webpackJsonp || [], n = o.push.bind(o);
        o.push = t, o = o.slice();
        for (var r = 0; r < o.length; r++) t(o[r]);
        var s = n;
        return i(i.s = 0)
    }([function (e, t, l) {
        e.exports = l(1)
    }, function (e, t, l) {
        "use strict";
        l.r(t);
        var a = {
            useJson: !1,
            mapConfig: {
                basemapUrl: "http://map.geoq.cn/arcgis/rest/services/ChinaOnlineStreetPurplishBlue/MapServer",
                center: [107.49023437497196, 30.372875188110612],
                zoom: 4
            },
            jsonData: {
                url: "https://ncportal.esrichina.com.cn/JKZX/",
                weekDataName: ["yq_20200124.json", "yq_20200125.json", "yq_20200126.json", "yq_20200127.json", "yq_20200128.json", "yq_20200129.json", "yq_20200130.json"],
                dataName: "yq_20200130.json",
                weekData: [{
                    "新增确诊": 449,
                    "新增疑似": 1118,
                    "新增死亡": 16,
                    "累计确诊": 1297,
                    "累计疑似": 1965,
                    "累计死亡": 41,
                    "日期": "1月24日"
                }, {
                    "新增确诊": 688,
                    "新增疑似": 1309,
                    "新增死亡": 15,
                    "累计确诊": 1985,
                    "累计疑似": 2684,
                    "累计死亡": 56,
                    "日期": "1月25日"
                }, {
                    "新增确诊": 776,
                    "新增疑似": 3806,
                    "新增死亡": 24,
                    "累计确诊": 2761,
                    "累计疑似": 5794,
                    "累计死亡": 80,
                    "日期": "1月26日"
                }, {
                    "新增确诊": 1774,
                    "新增疑似": 2077,
                    "新增死亡": 26,
                    "累计确诊": 4535,
                    "累计疑似": 6973,
                    "累计死亡": 106,
                    "日期": "1月27日"
                }, {
                    "新增确诊": 1462,
                    "新增疑似": 3248,
                    "新增死亡": 26,
                    "累计确诊": 5597,
                    "累计疑似": 9239,
                    "累计死亡": 132,
                    "日期": "1月28日"
                }, {
                    "新增确诊": 1739,
                    "新增疑似": 4148,
                    "新增死亡": 38,
                    "累计确诊": 7736,
                    "累计疑似": 12167,
                    "累计死亡": 170,
                    "日期": "1月29日"
                }, {"新增确诊": 1985, "新增疑似": 4812, "新增死亡": 44, "累计确诊": 9720, "累计疑似": 15238, "累计死亡": 213, "日期": "1月30日"}],
                proviceData: {
                    "北京市": [{
                        "新增确诊": 10,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 36,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 15, "新增疑似": 0, "新增死亡": 0, "累计确诊": 51, "累计疑似": 0, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 16,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 67,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 13, "新增疑似": 0, "新增死亡": 1, "累计确诊": 80, "累计疑似": 0, "累计死亡": 1, "日期": "1月27日"}, {
                        "新增确诊": 16,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 96,
                        "累计疑似": 0,
                        "累计死亡": 1,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 16,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 112,
                        "累计疑似": 0,
                        "累计死亡": 1,
                        "日期": "1月29日"
                    }, {"新增确诊": 20, "新增疑似": 0, "新增死亡": 0, "累计确诊": 132, "累计疑似": 0, "累计死亡": 1, "日期": "1月30日"}],
                    "天津市": [{
                        "新增确诊": 3,
                        "新增疑似": 27,
                        "新增死亡": 0,
                        "累计确诊": 8,
                        "累计疑似": 51,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 2, "新增疑似": 40, "新增死亡": 0, "累计确诊": 10, "累计疑似": 61, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 5,
                        "新增疑似": 48,
                        "新增死亡": 0,
                        "累计确诊": 15,
                        "累计疑似": 85,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 8, "新增疑似": 44, "新增死亡": 0, "累计确诊": 23, "累计疑似": 88, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 2,
                        "新增疑似": 45,
                        "新增死亡": 0,
                        "累计确诊": 25,
                        "累计疑似": 103,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 2,
                        "新增疑似": 40,
                        "新增死亡": 0,
                        "累计确诊": 27,
                        "累计疑似": 104,
                        "累计死亡": 0,
                        "日期": "1月29日"
                    }, {"新增确诊": 5, "新增疑似": 77, "新增死亡": 0, "累计确诊": 32, "累计疑似": 150, "累计死亡": 0, "日期": "1月30日"}],
                    "河北省": [{
                        "新增确诊": 6,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 8,
                        "累计疑似": 0,
                        "累计死亡": 1,
                        "日期": "1月24日"
                    }, {"新增确诊": 5, "新增疑似": 7, "新增死亡": 0, "累计确诊": 13, "累计疑似": 5, "累计死亡": 1, "日期": "1月25日"}, {
                        "新增确诊": 5,
                        "新增疑似": 11,
                        "新增死亡": 0,
                        "累计确诊": 18,
                        "累计疑似": 13,
                        "累计死亡": 1,
                        "日期": "1月26日"
                    }, {
                        "新增确诊": 15,
                        "新增疑似": 38,
                        "新增死亡": 0,
                        "累计确诊": 33,
                        "累计疑似": 20,
                        "累计死亡": 1,
                        "日期": "1月27日"
                    }, {
                        "新增确诊": 15,
                        "新增疑似": 45,
                        "新增死亡": 0,
                        "累计确诊": 48,
                        "累计疑似": 56,
                        "累计死亡": 1,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 17,
                        "新增疑似": 38,
                        "新增死亡": 0,
                        "累计确诊": 65,
                        "累计疑似": 68,
                        "累计死亡": 1,
                        "日期": "1月29日"
                    }, {"新增确诊": 17, "新增疑似": 51, "新增死亡": 0, "累计确诊": 82, "累计疑似": 78, "累计死亡": 1, "日期": "1月30日"}],
                    "山西省": [{
                        "新增确诊": 5,
                        "新增疑似": 9,
                        "新增死亡": 0,
                        "累计确诊": 6,
                        "累计疑似": 19,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 3, "新增疑似": 14, "新增死亡": 0, "累计确诊": 9, "累计疑似": 28, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 4,
                        "新增疑似": 34,
                        "新增死亡": 0,
                        "累计确诊": 13,
                        "累计疑似": 57,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 7, "新增疑似": 23, "新增死亡": 0, "累计确诊": 20, "累计疑似": 44, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 7,
                        "新增疑似": 21,
                        "新增死亡": 0,
                        "累计确诊": 27,
                        "累计疑似": 41,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {"新增确诊": 8, "新增疑似": 28, "新增死亡": 0, "累计确诊": 35, "累计疑似": 54, "累计死亡": 0, "日期": "1月29日"}, {
                        "新增确诊": 4,
                        "新增疑似": 23,
                        "新增死亡": 0,
                        "累计确诊": 39,
                        "累计疑似": 67,
                        "累计死亡": 0,
                        "日期": "1月30日"
                    }],
                    "内蒙古自治区": [{
                        "新增确诊": 1,
                        "新增疑似": 4,
                        "新增死亡": 0,
                        "累计确诊": 2,
                        "累计疑似": 5,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 5, "新增疑似": 0, "新增死亡": 0, "累计确诊": 7, "累计疑似": 0, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 4,
                        "新增疑似": 4,
                        "新增死亡": 0,
                        "累计确诊": 11,
                        "累计疑似": 1,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 2, "新增疑似": 1, "新增死亡": 0, "累计确诊": 13, "累计疑似": 2, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 3,
                        "新增疑似": 3,
                        "新增死亡": 0,
                        "累计确诊": 16,
                        "累计疑似": 3,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {"新增确诊": 2, "新增疑似": 0, "新增死亡": 0, "累计确诊": 18, "累计疑似": 0, "累计死亡": 0, "日期": "1月29日"}, {
                        "新增确诊": 2,
                        "新增疑似": 1,
                        "新增死亡": 0,
                        "累计确诊": 20,
                        "累计疑似": 1,
                        "累计死亡": 0,
                        "日期": "1月30日"
                    }],
                    "辽宁省": [{
                        "新增确诊": 8,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 12,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 5, "新增疑似": 18, "新增死亡": 0, "累计确诊": 17, "累计疑似": 24, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 5,
                        "新增疑似": 37,
                        "新增死亡": 0,
                        "累计确诊": 22,
                        "累计疑似": 40,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 5, "新增疑似": 22, "新增死亡": 0, "累计确诊": 27, "累计疑似": 52, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 9,
                        "新增疑似": 40,
                        "新增死亡": 0,
                        "累计确诊": 36,
                        "累计疑似": 72,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {"新增确诊": 3, "新增疑似": 35, "新增死亡": 0, "累计确诊": 39, "累计疑似": 85, "累计死亡": 0, "日期": "1月29日"}, {
                        "新增确诊": 6,
                        "新增疑似": 45,
                        "新增死亡": 0,
                        "累计确诊": 45,
                        "累计疑似": 89,
                        "累计死亡": 0,
                        "日期": "1月30日"
                    }],
                    "吉林省": [{
                        "新增确诊": 1,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 4,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 0, "新增疑似": 3, "新增死亡": 0, "累计确诊": 4, "累计疑似": 3, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 2,
                        "新增疑似": 1,
                        "新增死亡": 0,
                        "累计确诊": 6,
                        "累计疑似": 3,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 2, "新增疑似": 1, "新增死亡": 0, "累计确诊": 8, "累计疑似": 3, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 1,
                        "新增疑似": 1,
                        "新增死亡": 0,
                        "累计确诊": 9,
                        "累计疑似": 2,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {"新增确诊": 5, "新增疑似": 5, "新增死亡": 0, "累计确诊": 14, "累计疑似": 10, "累计死亡": 0, "日期": "1月29日"}, {
                        "新增确诊": 0,
                        "新增疑似": 3,
                        "新增死亡": 0,
                        "累计确诊": 14,
                        "累计疑似": 10,
                        "累计死亡": 0,
                        "日期": "1月30日"
                    }],
                    "黑龙江省": [{
                        "新增确诊": 6,
                        "新增疑似": 12,
                        "新增死亡": 1,
                        "累计确诊": 9,
                        "累计疑似": 18,
                        "累计死亡": 1,
                        "日期": "1月24日"
                    }, {"新增确诊": 6, "新增疑似": 9, "新增死亡": 0, "累计确诊": 15, "累计疑似": 13, "累计死亡": 1, "日期": "1月25日"}, {
                        "新增确诊": 6,
                        "新增疑似": 40,
                        "新增死亡": 0,
                        "累计确诊": 21,
                        "累计疑似": 47,
                        "累计死亡": 1,
                        "日期": "1月26日"
                    }, {"新增确诊": 9, "新增疑似": 36, "新增死亡": 0, "累计确诊": 30, "累计疑似": 67, "累计死亡": 1, "日期": "1月27日"}, {
                        "新增确诊": 7,
                        "新增疑似": 45,
                        "新增死亡": 0,
                        "累计确诊": 37,
                        "累计疑似": 68,
                        "累计死亡": 1,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 6,
                        "新增疑似": 48,
                        "新增死亡": 0,
                        "累计确诊": 43,
                        "累计疑似": 105,
                        "累计死亡": 1,
                        "日期": "1月29日"
                    }, {"新增确诊": 16, "新增疑似": 76, "新增死亡": 1, "累计确诊": 59, "累计疑似": 128, "累计死亡": 2, "日期": "1月30日"}],
                    "上海市": [{
                        "新增确诊": 13,
                        "新增疑似": 81,
                        "新增死亡": 0,
                        "累计确诊": 33,
                        "累计疑似": 72,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {
                        "新增确诊": 7,
                        "新增疑似": 52,
                        "新增死亡": 1,
                        "累计确诊": 40,
                        "累计疑似": 95,
                        "累计死亡": 1,
                        "日期": "1月25日"
                    }, {
                        "新增确诊": 13,
                        "新增疑似": 65,
                        "新增死亡": 0,
                        "累计确诊": 53,
                        "累计疑似": 90,
                        "累计死亡": 1,
                        "日期": "1月26日"
                    }, {
                        "新增确诊": 13,
                        "新增疑似": 70,
                        "新增死亡": 0,
                        "累计确诊": 66,
                        "累计疑似": 129,
                        "累计死亡": 1,
                        "日期": "1月27日"
                    }, {
                        "新增确诊": 14,
                        "新增疑似": 70,
                        "新增死亡": 0,
                        "累计确诊": 80,
                        "累计疑似": 167,
                        "累计死亡": 1,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 21,
                        "新增疑似": 46,
                        "新增死亡": 0,
                        "累计确诊": 101,
                        "累计疑似": 180,
                        "累计死亡": 1,
                        "日期": "1月29日"
                    }, {"新增确诊": 27, "新增疑似": 91, "新增死亡": 0, "累计确诊": 128, "累计疑似": 164, "累计死亡": 1, "日期": "1月30日"}],
                    "江苏省": [{
                        "新增确诊": 9,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 14,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 17, "新增疑似": 0, "新增死亡": 0, "累计确诊": 31, "累计疑似": 0, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 16,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 47,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 23, "新增疑似": 0, "新增死亡": 0, "累计确诊": 70, "累计疑似": 0, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 29,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 99,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 30,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 129,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月29日"
                    }, {"新增确诊": 39, "新增疑似": 0, "新增死亡": 0, "累计确诊": 168, "累计疑似": 0, "累计死亡": 0, "日期": "1月30日"}],
                    "浙江省": [{
                        "新增确诊": 19,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 62,
                        "累计疑似": 27,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {
                        "新增确诊": 42,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 104,
                        "累计疑似": 20,
                        "累计死亡": 0,
                        "日期": "1月25日"
                    }, {
                        "新增确诊": 24,
                        "新增疑似": 68,
                        "新增死亡": 0,
                        "累计确诊": 128,
                        "累计疑似": 63,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {
                        "新增确诊": 45,
                        "新增疑似": 52,
                        "新增死亡": 0,
                        "累计确诊": 173,
                        "累计疑似": 115,
                        "累计死亡": 0,
                        "日期": "1月27日"
                    }, {
                        "新增确诊": 123,
                        "新增疑似": 105,
                        "新增死亡": 0,
                        "累计确诊": 296,
                        "累计疑似": 101,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 132,
                        "新增疑似": 103,
                        "新增死亡": 0,
                        "累计确诊": 428,
                        "累计疑似": 117,
                        "累计死亡": 0,
                        "日期": "1月29日"
                    }, {"新增确诊": 109, "新增疑似": 102, "新增死亡": 0, "累计确诊": 537, "累计疑似": 154, "累计死亡": 0, "日期": "1月30日"}],
                    "安徽省": [{
                        "新增确诊": 24,
                        "新增疑似": 26,
                        "新增死亡": 0,
                        "累计确诊": 39,
                        "累计疑似": 20,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {
                        "新增确诊": 21,
                        "新增疑似": 18,
                        "新增死亡": 0,
                        "累计确诊": 60,
                        "累计疑似": 15,
                        "累计死亡": 0,
                        "日期": "1月25日"
                    }, {
                        "新增确诊": 10,
                        "新增疑似": 36,
                        "新增死亡": 0,
                        "累计确诊": 70,
                        "累计疑似": 43,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {
                        "新增确诊": 36,
                        "新增疑似": 38,
                        "新增死亡": 0,
                        "累计确诊": 106,
                        "累计疑似": 42,
                        "累计死亡": 0,
                        "日期": "1月27日"
                    }, {
                        "新增确诊": 46,
                        "新增疑似": 43,
                        "新增死亡": 0,
                        "累计确诊": 152,
                        "累计疑似": 55,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 48,
                        "新增疑似": 45,
                        "新增死亡": 0,
                        "累计确诊": 200,
                        "累计疑似": 67,
                        "累计死亡": 0,
                        "日期": "1月29日"
                    }, {"新增确诊": 37, "新增疑似": 71, "新增死亡": 0, "累计确诊": 237, "累计疑似": 98, "累计死亡": 0, "日期": "1月30日"}],
                    "福建省": [{
                        "新增确诊": 5,
                        "新增疑似": 6,
                        "新增死亡": 0,
                        "累计确诊": 10,
                        "累计疑似": 7,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {
                        "新增确诊": 8,
                        "新增疑似": 25,
                        "新增死亡": 0,
                        "累计确诊": 18,
                        "累计疑似": 27,
                        "累计死亡": 0,
                        "日期": "1月25日"
                    }, {
                        "新增确诊": 17,
                        "新增疑似": 49,
                        "新增死亡": 0,
                        "累计确诊": 35,
                        "累计疑似": 59,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {
                        "新增确诊": 24,
                        "新增疑似": 37,
                        "新增死亡": 0,
                        "累计确诊": 59,
                        "累计疑似": 68,
                        "累计死亡": 0,
                        "日期": "1月27日"
                    }, {
                        "新增确诊": 23,
                        "新增疑似": 45,
                        "新增死亡": 0,
                        "累计确诊": 82,
                        "累计疑似": 80,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 19,
                        "新增疑似": 54,
                        "新增死亡": 0,
                        "累计确诊": 101,
                        "累计疑似": 110,
                        "累计死亡": 0,
                        "日期": "1月29日"
                    }, {"新增确诊": 19, "新增疑似": 58, "新增死亡": 0, "累计确诊": 120, "累计疑似": 116, "累计死亡": 0, "日期": "1月30日"}],
                    "江西省": [{
                        "新增确诊": 11,
                        "新增疑似": 27,
                        "新增死亡": 0,
                        "累计确诊": 18,
                        "累计疑似": 38,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {
                        "新增确诊": 18,
                        "新增疑似": 21,
                        "新增死亡": 0,
                        "累计确诊": 36,
                        "累计疑似": 30,
                        "累计死亡": 0,
                        "日期": "1月25日"
                    }, {
                        "新增确诊": 12,
                        "新增疑似": 50,
                        "新增死亡": 0,
                        "累计确诊": 48,
                        "累计疑似": 68,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {
                        "新增确诊": 24,
                        "新增疑似": 46,
                        "新增死亡": 0,
                        "累计确诊": 72,
                        "累计疑似": 88,
                        "累计死亡": 0,
                        "日期": "1月27日"
                    }, {
                        "新增确诊": 37,
                        "新增疑似": 60,
                        "新增死亡": 0,
                        "累计确诊": 109,
                        "累计疑似": 107,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 53,
                        "新增疑似": 61,
                        "新增死亡": 0,
                        "累计确诊": 162,
                        "累计疑似": 123,
                        "累计死亡": 0,
                        "日期": "1月29日"
                    }, {"新增确诊": 78, "新增疑似": 106, "新增死亡": 0, "累计确诊": 240, "累计疑似": 197, "累计死亡": 0, "日期": "1月30日"}],
                    "山东省": [{
                        "新增确诊": 11,
                        "新增疑似": 27,
                        "新增死亡": 0,
                        "累计确诊": 18,
                        "累计疑似": 38,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {
                        "新增确诊": 18,
                        "新增疑似": 12,
                        "新增死亡": 0,
                        "累计确诊": 39,
                        "累计疑似": 11,
                        "累计死亡": 0,
                        "日期": "1月25日"
                    }, {
                        "新增确诊": 22,
                        "新增疑似": 33,
                        "新增死亡": 0,
                        "累计确诊": 61,
                        "累计疑似": 35,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {
                        "新增确诊": 26,
                        "新增疑似": 24,
                        "新增死亡": 0,
                        "累计确诊": 87,
                        "累计疑似": 42,
                        "累计死亡": 0,
                        "日期": "1月27日"
                    }, {
                        "新增确诊": 34,
                        "新增疑似": 39,
                        "新增死亡": 0,
                        "累计确诊": 121,
                        "累计疑似": 55,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 24,
                        "新增疑似": 37,
                        "新增死亡": 0,
                        "累计确诊": 145,
                        "累计疑似": 79,
                        "累计死亡": 0,
                        "日期": "1月29日"
                    }, {"新增确诊": 33, "新增疑似": 54, "新增死亡": 0, "累计确诊": 178, "累计疑似": 90, "累计死亡": 0, "日期": "1月30日"}],
                    "河南省": [{
                        "新增确诊": 23,
                        "新增疑似": 54,
                        "新增死亡": 0,
                        "累计确诊": 32,
                        "累计疑似": 116,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {
                        "新增确诊": 51,
                        "新增疑似": 114,
                        "新增死亡": 1,
                        "累计确诊": 83,
                        "累计疑似": 165,
                        "累计死亡": 1,
                        "日期": "1月25日"
                    }, {
                        "新增确诊": 45,
                        "新增疑似": 112,
                        "新增死亡": 0,
                        "累计确诊": 128,
                        "累计疑似": 212,
                        "累计死亡": 1,
                        "日期": "1月26日"
                    }, {
                        "新增确诊": 40,
                        "新增疑似": 122,
                        "新增死亡": 0,
                        "累计确诊": 168,
                        "累计疑似": 266,
                        "累计死亡": 1,
                        "日期": "1月27日"
                    }, {
                        "新增确诊": 38,
                        "新增疑似": 232,
                        "新增死亡": 1,
                        "累计确诊": 206,
                        "累计疑似": 411,
                        "累计死亡": 2,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 72,
                        "新增疑似": 267,
                        "新增死亡": 0,
                        "累计确诊": 278,
                        "累计疑似": 584,
                        "累计死亡": 2,
                        "日期": "1月29日"
                    }, {"新增确诊": 74, "新增疑似": 280, "新增死亡": 0, "累计确诊": 352, "累计疑似": 735, "累计死亡": 2, "日期": "1月30日"}],
                    "湖北省": [{
                        "新增确诊": 180,
                        "新增疑似": 704,
                        "新增死亡": 15,
                        "累计确诊": 729,
                        "累计疑似": 1405,
                        "累计死亡": 39,
                        "日期": "1月24日"
                    }, {
                        "新增确诊": 323,
                        "新增疑似": 712,
                        "新增死亡": 13,
                        "累计确诊": 1052,
                        "累计疑似": 1887,
                        "累计死亡": 52,
                        "日期": "1月25日"
                    }, {
                        "新增确诊": 371,
                        "新增疑似": 2793,
                        "新增死亡": 24,
                        "累计确诊": 1423,
                        "累计疑似": 4472,
                        "累计死亡": 76,
                        "日期": "1月26日"
                    }, {
                        "新增确诊": 1291,
                        "新增疑似": 1191,
                        "新增死亡": 24,
                        "累计确诊": 2714,
                        "累计疑似": 5324,
                        "累计死亡": 100,
                        "日期": "1月27日"
                    }, {
                        "新增确诊": 840,
                        "新增疑似": 1876,
                        "新增死亡": 25,
                        "累计确诊": 3554,
                        "累计疑似": 6940,
                        "累计死亡": 125,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 1032,
                        "新增疑似": 2493,
                        "新增死亡": 37,
                        "累计确诊": 4586,
                        "累计疑似": 9033,
                        "累计死亡": 162,
                        "日期": "1月29日"
                    }, {
                        "新增确诊": 1220,
                        "新增疑似": 2867,
                        "新增死亡": 42,
                        "累计确诊": 5806,
                        "累计疑似": 11272,
                        "累计死亡": 204,
                        "日期": "1月30日"
                    }],
                    "湖南省": [{
                        "新增确诊": 15,
                        "新增疑似": 25,
                        "新增死亡": 0,
                        "累计确诊": 24,
                        "累计疑似": 35,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {
                        "新增确诊": 45,
                        "新增疑似": 34,
                        "新增死亡": 0,
                        "累计确诊": 69,
                        "累计疑似": 25,
                        "累计死亡": 0,
                        "日期": "1月25日"
                    }, {
                        "新增确诊": 31,
                        "新增疑似": 47,
                        "新增死亡": 0,
                        "累计确诊": 100,
                        "累计疑似": 42,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {
                        "新增确诊": 43,
                        "新增疑似": 53,
                        "新增死亡": 0,
                        "累计确诊": 143,
                        "累计疑似": 52,
                        "累计死亡": 0,
                        "日期": "1月27日"
                    }, {
                        "新增确诊": 78,
                        "新增疑似": 114,
                        "新增死亡": 0,
                        "累计确诊": 221,
                        "累计疑似": 85,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 56,
                        "新增疑似": 202,
                        "新增死亡": 0,
                        "累计确诊": 277,
                        "累计疑似": 223,
                        "累计死亡": 0,
                        "日期": "1月29日"
                    }, {"新增确诊": 55, "新增疑似": 152, "新增死亡": 0, "累计确诊": 332, "累计疑似": 303, "累计死亡": 0, "日期": "1月30日"}],
                    "广东省": [{
                        "新增确诊": 25,
                        "新增疑似": 30,
                        "新增死亡": 0,
                        "累计确诊": 78,
                        "累计疑似": 18,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {
                        "新增确诊": 20,
                        "新增疑似": 45,
                        "新增死亡": 0,
                        "累计确诊": 98,
                        "累计疑似": 40,
                        "累计死亡": 0,
                        "日期": "1月25日"
                    }, {
                        "新增确诊": 48,
                        "新增疑似": 73,
                        "新增死亡": 0,
                        "累计确诊": 146,
                        "累计疑似": 54,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {
                        "新增确诊": 42,
                        "新增疑似": 47,
                        "新增死亡": 0,
                        "累计确诊": 188,
                        "累计疑似": 73,
                        "累计死亡": 0,
                        "日期": "1月27日"
                    }, {
                        "新增确诊": 53,
                        "新增疑似": 91,
                        "新增死亡": 0,
                        "累计确诊": 241,
                        "累计疑似": 122,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 70,
                        "新增疑似": 78,
                        "新增死亡": 0,
                        "累计确诊": 311,
                        "累计疑似": 137,
                        "累计死亡": 0,
                        "日期": "1月29日"
                    }, {"新增确诊": 82, "新增疑似": 77, "新增死亡": 0, "累计确诊": 393, "累计疑似": 151, "累计死亡": 0, "日期": "1月30日"}],
                    "广西壮族自治区": [{
                        "新增确诊": 10,
                        "新增疑似": 13,
                        "新增死亡": 0,
                        "累计确诊": 23,
                        "累计疑似": 6,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {
                        "新增确诊": 10,
                        "新增疑似": 21,
                        "新增死亡": 0,
                        "累计确诊": 33,
                        "累计疑似": 21,
                        "累计死亡": 0,
                        "日期": "1月25日"
                    }, {
                        "新增确诊": 13,
                        "新增疑似": 35,
                        "新增死亡": 0,
                        "累计确诊": 46,
                        "累计疑似": 40,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 5, "新增疑似": 49, "新增死亡": 0, "累计确诊": 51, "累计疑似": 11, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 7,
                        "新增疑似": 74,
                        "新增死亡": 0,
                        "累计确诊": 58,
                        "累计疑似": 118,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 20,
                        "新增疑似": 102,
                        "新增死亡": 0,
                        "累计确诊": 78,
                        "累计疑似": 155,
                        "累计死亡": 0,
                        "日期": "1月29日"
                    }, {"新增确诊": 9, "新增疑似": 117, "新增死亡": 0, "累计确诊": 87, "累计疑似": 256, "累计死亡": 0, "日期": "1月30日"}],
                    "海南省": [{
                        "新增确诊": 5,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 10,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 10, "新增疑似": 0, "新增死亡": 0, "累计确诊": 20, "累计疑似": 1, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 7,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 27,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {
                        "新增确诊": 11,
                        "新增疑似": 21,
                        "新增死亡": 1,
                        "累计确诊": 38,
                        "累计疑似": 21,
                        "累计死亡": 1,
                        "日期": "1月27日"
                    }, {"新增确诊": 5, "新增疑似": 27, "新增死亡": 0, "累计确诊": 43, "累计疑似": 48, "累计死亡": 1, "日期": "1月28日"}, {
                        "新增确诊": 3,
                        "新增疑似": 18,
                        "新增死亡": 0,
                        "累计确诊": 46,
                        "累计疑似": 66,
                        "累计死亡": 1,
                        "日期": "1月29日"
                    }, {"新增确诊": 3, "新增疑似": 28, "新增死亡": 0, "累计确诊": 49, "累计疑似": 73, "累计死亡": 1, "日期": "1月30日"}],
                    "重庆市": [{
                        "新增确诊": 30,
                        "新增疑似": 55,
                        "新增死亡": 0,
                        "累计确诊": 57,
                        "累计疑似": 86,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {
                        "新增确诊": 18,
                        "新增疑似": 106,
                        "新增死亡": 0,
                        "累计确诊": 75,
                        "累计疑似": 146,
                        "累计死亡": 0,
                        "日期": "1月25日"
                    }, {
                        "新增确诊": 35,
                        "新增疑似": 117,
                        "新增死亡": 0,
                        "累计确诊": 110,
                        "累计疑似": 188,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {
                        "新增确诊": 22,
                        "新增疑似": 31,
                        "新增死亡": 0,
                        "累计确诊": 132,
                        "累计疑似": 219,
                        "累计死亡": 0,
                        "日期": "1月27日"
                    }, {
                        "新增确诊": 15,
                        "新增疑似": 108,
                        "新增死亡": 0,
                        "累计确诊": 147,
                        "累计疑似": 246,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 18,
                        "新增疑似": 152,
                        "新增死亡": 0,
                        "累计确诊": 165,
                        "累计疑似": 279,
                        "累计死亡": 0,
                        "日期": "1月29日"
                    }, {"新增确诊": 41, "新增疑似": 192, "新增死亡": 0, "累计确诊": 206, "累计疑似": 378, "累计死亡": 0, "日期": "1月30日"}],
                    "四川省": [{
                        "新增确诊": 13,
                        "新增疑似": 25,
                        "新增死亡": 0,
                        "累计确诊": 28,
                        "累计疑似": 25,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {
                        "新增确诊": 16,
                        "新增疑似": 26,
                        "新增死亡": 0,
                        "累计确诊": 44,
                        "累计疑似": 34,
                        "累计死亡": 0,
                        "日期": "1月25日"
                    }, {
                        "新增确诊": 25,
                        "新增疑似": 79,
                        "新增死亡": 0,
                        "累计确诊": 69,
                        "累计疑似": 92,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {
                        "新增确诊": 21,
                        "新增疑似": 78,
                        "新增死亡": 0,
                        "累计确诊": 90,
                        "累计疑似": 138,
                        "累计死亡": 0,
                        "日期": "1月27日"
                    }, {
                        "新增确诊": 18,
                        "新增疑似": 87,
                        "新增死亡": 0,
                        "累计确诊": 108,
                        "累计疑似": 182,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 34,
                        "新增疑似": 106,
                        "新增死亡": 1,
                        "累计确诊": 142,
                        "累计疑似": 243,
                        "累计死亡": 1,
                        "日期": "1月29日"
                    }, {"新增确诊": 36, "新增疑似": 97, "新增死亡": 0, "累计确诊": 177, "累计疑似": 241, "累计死亡": 1, "日期": "1月30日"}],
                    "贵州省": [{
                        "新增确诊": 1,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 4,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 2, "新增疑似": 3, "新增死亡": 0, "累计确诊": 7, "累计疑似": 3, "累计死亡": 0, "日期": "1月26日"}, {
                        "新增确诊": 2,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 9,
                        "累计疑似": 1,
                        "累计死亡": 0,
                        "日期": "1月27日"
                    }, {"新增确诊": 0, "新增疑似": 3, "新增死亡": 0, "累计确诊": 9, "累计疑似": 3, "累计死亡": 0, "日期": "1月28日"}, {
                        "新增确诊": 3,
                        "新增疑似": 6,
                        "新增死亡": 0,
                        "累计确诊": 12,
                        "累计疑似": 6,
                        "累计死亡": 0,
                        "日期": "1月29日"
                    }, {"新增确诊": 3, "新增疑似": 72, "新增死亡": 0, "累计确诊": 15, "累计疑似": 75, "累计死亡": 0, "日期": "1月30日"}],
                    "云南省": [{
                        "新增确诊": 3,
                        "新增疑似": 4,
                        "新增死亡": 0,
                        "累计确诊": 5,
                        "累计疑似": 4,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {
                        "新增确诊": 10,
                        "新增疑似": 55,
                        "新增死亡": 0,
                        "累计确诊": 21,
                        "累计疑似": 75,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {
                        "新增确诊": 11,
                        "新增疑似": 51,
                        "新增死亡": 0,
                        "累计确诊": 32,
                        "累计疑似": 104,
                        "累计死亡": 0,
                        "日期": "1月27日"
                    }, {
                        "新增确诊": 19,
                        "新增疑似": 65,
                        "新增死亡": 0,
                        "累计确诊": 51,
                        "累计疑似": 163,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 19,
                        "新增疑似": 90,
                        "新增死亡": 0,
                        "累计确诊": 70,
                        "累计疑似": 191,
                        "累计死亡": 0,
                        "日期": "1月29日"
                    }, {"新增确诊": 10, "新增疑似": 107, "新增死亡": 0, "累计确诊": 80, "累计疑似": 236, "累计死亡": 0, "日期": "1月30日"}],
                    "西藏自治区": [{
                        "新增确诊": 0,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 0,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 0, "新增疑似": 0, "新增死亡": 0, "累计确诊": 0, "累计疑似": 0, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 0,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 0,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 0, "新增疑似": 0, "新增死亡": 0, "累计确诊": 0, "累计疑似": 0, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 0,
                        "新增疑似": 1,
                        "新增死亡": 0,
                        "累计确诊": 0,
                        "累计疑似": 1,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {"新增确诊": 1, "新增疑似": 0, "新增死亡": 0, "累计确诊": 1, "累计疑似": 0, "累计死亡": 0, "日期": "1月29日"}, {
                        "新增确诊": 0,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 1,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月30日"
                    }],
                    "陕西省": [{
                        "新增确诊": 2,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 5,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 10, "新增疑似": 0, "新增死亡": 0, "累计确诊": 15, "累计疑似": 0, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 7,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 22,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 13, "新增疑似": 0, "新增死亡": 0, "累计确诊": 35, "累计疑似": 0, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 11,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 46,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {
                        "新增确诊": 17,
                        "新增疑似": 67,
                        "新增死亡": 0,
                        "累计确诊": 63,
                        "累计疑似": 116,
                        "累计死亡": 0,
                        "日期": "1月29日"
                    }, {"新增确诊": 24, "新增疑似": 47, "新增死亡": 0, "累计确诊": 87, "累计疑似": 132, "累计死亡": 0, "日期": "1月30日"}],
                    "甘肃省": [{
                        "新增确诊": 2,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 4,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 3, "新增疑似": 0, "新增死亡": 0, "累计确诊": 7, "累计疑似": 0, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 7,
                        "新增疑似": 6,
                        "新增死亡": 0,
                        "累计确诊": 14,
                        "累计疑似": 6,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 5, "新增疑似": 0, "新增死亡": 0, "累计确诊": 19, "累计疑似": 2, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 5,
                        "新增疑似": 5,
                        "新增死亡": 0,
                        "累计确诊": 24,
                        "累计疑似": 5,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {"新增确诊": 2, "新增疑似": 6, "新增死亡": 0, "累计确诊": 26, "累计疑似": 8, "累计死亡": 0, "日期": "1月29日"}, {
                        "新增确诊": 4,
                        "新增疑似": 5,
                        "新增死亡": 0,
                        "累计确诊": 30,
                        "累计疑似": 15,
                        "累计死亡": 0,
                        "日期": "1月30日"
                    }],
                    "青海省": [{
                        "新增确诊": 0,
                        "新增疑似": 1,
                        "新增死亡": 0,
                        "累计确诊": 0,
                        "累计疑似": 1,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 1, "新增疑似": 0, "新增死亡": 0, "累计确诊": 1, "累计疑似": 0, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 3,
                        "新增疑似": 3,
                        "新增死亡": 0,
                        "累计确诊": 4,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 2, "新增疑似": 0, "新增死亡": 0, "累计确诊": 6, "累计疑似": 0, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 0,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 6,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {"新增确诊": 0, "新增疑似": 1, "新增死亡": 0, "累计确诊": 6, "累计疑似": 1, "累计死亡": 0, "日期": "1月29日"}, {
                        "新增确诊": 2,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 8,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月30日"
                    }],
                    "宁夏回族自治区": [{
                        "新增确诊": 1,
                        "新增疑似": 1,
                        "新增死亡": 0,
                        "累计确诊": 3,
                        "累计疑似": 1,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 1, "新增疑似": 0, "新增死亡": 0, "累计确诊": 4, "累计疑似": 1, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 3,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 7,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 4, "新增疑似": 0, "新增死亡": 0, "累计确诊": 11, "累计疑似": 0, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 1,
                        "新增疑似": 2,
                        "新增死亡": 0,
                        "累计确诊": 12,
                        "累计疑似": 2,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {"新增确诊": 5, "新增疑似": 0, "新增死亡": 0, "累计确诊": 17, "累计疑似": 1, "累计死亡": 0, "日期": "1月29日"}, {
                        "新增确诊": 4,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 21,
                        "累计疑似": 1,
                        "累计死亡": 0,
                        "日期": "1月30日"
                    }],
                    "新疆维吾尔自治区": [{
                        "新增确诊": 1,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 3,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 1, "新增疑似": 1, "新增死亡": 0, "累计确诊": 4, "累计疑似": 1, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 1,
                        "新增疑似": 7,
                        "新增死亡": 0,
                        "累计确诊": 5,
                        "累计疑似": 6,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 5, "新增疑似": 2, "新增死亡": 0, "累计确诊": 10, "累计疑似": 2, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 3,
                        "新增疑似": 1,
                        "新增死亡": 0,
                        "累计确诊": 13,
                        "累计疑似": 3,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {"新增确诊": 1, "新增疑似": 20, "新增死亡": 0, "累计确诊": 14, "累计疑似": 22, "累计死亡": 0, "日期": "1月29日"}, {
                        "新增确诊": 3,
                        "新增疑似": 13,
                        "新增死亡": 0,
                        "累计确诊": 17,
                        "累计疑似": 28,
                        "累计死亡": 0,
                        "日期": "1月30日"
                    }],
                    "台湾省": [{
                        "新增确诊": 0,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 0,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 0, "新增疑似": 0, "新增死亡": 0, "累计确诊": 0, "累计疑似": 0, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 0,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 0,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 0, "新增疑似": 0, "新增死亡": 0, "累计确诊": 5, "累计疑似": 0, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 0,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 8,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {"新增确诊": 0, "新增疑似": 0, "新增死亡": 0, "累计确诊": 8, "累计疑似": 0, "累计死亡": 0, "日期": "1月29日"}, {
                        "新增确诊": 1,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 9,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月30日"
                    }],
                    "澳门特别行政区": [{
                        "新增确诊": 0,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 0,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 0, "新增疑似": 0, "新增死亡": 0, "累计确诊": 0, "累计疑似": 0, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 0,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 0,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 0, "新增疑似": 0, "新增死亡": 0, "累计确诊": 7, "累计疑似": 0, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 0,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 7,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {"新增确诊": 0, "新增疑似": 0, "新增死亡": 0, "累计确诊": 7, "累计疑似": 0, "累计死亡": 0, "日期": "1月29日"}, {
                        "新增确诊": 0,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 7,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月30日"
                    }],
                    "香港特别行政区": [{
                        "新增确诊": 0,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 0,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月24日"
                    }, {"新增确诊": 0, "新增疑似": 0, "新增死亡": 0, "累计确诊": 0, "累计疑似": 0, "累计死亡": 0, "日期": "1月25日"}, {
                        "新增确诊": 0,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 0,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月26日"
                    }, {"新增确诊": 0, "新增疑似": 0, "新增死亡": 0, "累计确诊": 8, "累计疑似": 0, "累计死亡": 0, "日期": "1月27日"}, {
                        "新增确诊": 0,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 8,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月28日"
                    }, {"新增确诊": 2, "新增疑似": 0, "新增死亡": 0, "累计确诊": 10, "累计疑似": 0, "累计死亡": 0, "日期": "1月29日"}, {
                        "新增确诊": 2,
                        "新增疑似": 0,
                        "新增死亡": 0,
                        "累计确诊": 12,
                        "累计疑似": 0,
                        "累计死亡": 0,
                        "日期": "1月30日"
                    }]
                }
            },
            layerConfig: {geojsonUrl: "https://ncportal.esrichina.com.cn/JKZX/yq_20200130.json"},
            dateDisplayConfig: {month: 1, day: 30},
            quezhenNew: 1985,
            yisiNew: 4812,
            siwangNew: 44,
            quezhenSum: 9720,
            yisiSum: 15238,
            siwangSum: 213
        }, i = [{fullName: "北京市", simpleName: "北京"}, {fullName: "天津市", simpleName: "天津"}, {
            fullName: "上海市",
            simpleName: "上海"
        }, {fullName: "重庆市", simpleName: "重庆"}, {fullName: "河北省", simpleName: "河北"}, {
            fullName: "河南省",
            simpleName: "河南"
        }, {fullName: "湖北省", simpleName: "湖北"}, {fullName: "湖南省", simpleName: "湖南"}, {
            fullName: "江苏省",
            simpleName: "江苏"
        }, {fullName: "江西省", simpleName: "江西"}, {fullName: "辽宁省", simpleName: "辽宁"}, {
            fullName: "吉林省",
            simpleName: "吉林"
        }, {fullName: "黑龙江省", simpleName: "黑龙江"}, {fullName: "陕西省", simpleName: "陕西"}, {
            fullName: "山西省",
            simpleName: "山西"
        }, {fullName: "山东省", simpleName: "山东"}, {fullName: "四川省", simpleName: "四川"}, {
            fullName: "青海省",
            simpleName: "青海"
        }, {fullName: "安徽省", simpleName: "安徽"}, {fullName: "海南省", simpleName: "海南"}, {
            fullName: "广东省",
            simpleName: "广东"
        }, {fullName: "贵州省", simpleName: "贵州"}, {fullName: "浙江省", simpleName: "浙江"}, {
            fullName: "福建省",
            simpleName: "福建"
        }, {fullName: "台湾省", simpleName: "台湾"}, {fullName: "甘肃省", simpleName: "甘肃"}, {
            fullName: "云南省",
            simpleName: "云南"
        }, {fullName: "西藏自治区", simpleName: "西藏"}, {fullName: "宁夏回族自治区", simpleName: "宁夏"}, {
            fullName: "广西壮族自治区",
            simpleName: "广西"
        }, {fullName: "新疆维吾尔自治区", simpleName: "新疆"}, {fullName: "内蒙古自治区", simpleName: "内蒙古"}, {
            fullName: "香港特别行政区",
            simpleName: "香港"
        }, {fullName: "澳门特别行政区", simpleName: "澳门"}];

        function o(e) {
            var t;
            return i.forEach((function (l) {
                l.fullName === e && (t = l.simpleName)
            })), t
        }

        var n = {
            _initLeftPart_new: function (e) {
                var t;
                t = a.useJson ? this.getSum(e) : {quezhen: a.quezhenNew, yisi: a.yisiNew, siwang: a.siwangNew};
                var l = "";
                $("#statusButton").show(), l += '<div class = "row" id="part1">', l += '<div class = "col-sm-12 part">', l += '<div class="graph-title" id="graph-title-traffic" style="border-left: 5px solid rgb(0, 180, 255);">', l += '<div style="width: 70%;  float: left;">', l += '<p class="graph-brand-text" style="font-size:0.16rem;font-weight:600;margin-bottom:3px;">当日概况（包括港澳台）</p>', l += '<span id="time1" class="graph-brand-subtext" style="font-size:12px;color:#999"></span>', l += "</div>", l += "</div>", l += '<div class = "eventStatus">', l += '<div id="numchange1" class="col-sm-4" style="text-align: center;height:100%">', l += '<div id="aa" style="font-size:0.36rem;font-weight:500;color: rgb(224, 32, 32);">' + t.quezhen, l += "</div>", l += '<p class="numberp">确诊</p>', l += "</div>", l += '<div id="numchange2" class="col-sm-4" style="text-align: center;height:100%">', l += '<div id="bb" style="font-size:0.36rem;font-weight:500;color: rgb(255,242,104);">' + t.yisi, l += "</div>", l += '<p class="numberp">疑似</p>', l += "</div>", l += '<div id="numchange3" class="col-sm-4" style="text-align: center;height:100%">', l += '<div id="bb" style="font-size:0.36rem;font-weight:500;color: rgb(84,151,211);">' + t.siwang, l += "</div>", l += '<p class="numberp">死亡</p>', l += "</div>", l += "</div>", l += "</div>", l += "</div>", l += '<div class = "row" id = "part2">', l += '<div class = "col-sm-12 part">', l += '<div class="graph-title" id="graph-title-traffic" style="border-left: 5px solid rgb(0, 180, 255);">', l += '<div style="width: 70%;  float: left;">', l += '<p class="graph-brand-text" style="font-size:0.16rem;font-weight:600;margin-bottom:3px;">新增病例详情</p>', l += '<span id="time2" class="graph-brand-subtext" style="font-size:12px;color:#999"></span>', l += "</div>", l += "</div>", l += '<div class="areaChart" id="sort10">', l += "</div>", l += "</div>", l += "</div>", $("#leftContent").html(l), this._initLYChart_new("sort10", "0", e);
                var i = $("#leftContent").height() - $("#part1").outerHeight(!0);
                $("#part2").css({height: i});
                var o = i - $("#graph-title-traffic").outerHeight(!0);
                $("#sort10").css({height: o, "overflow-y": "scroll"}), $(window).on("resize", (function () {
                    var e = $("#leftContent").height() - $("#part1").outerHeight(!0);
                    $("#part2").css({height: e});
                    var t = e - $("#graph-title-traffic").outerHeight(!0);
                    $("#sort10").css({height: t, "overflow-y": "scroll"})
                })), setInterval((function () {
                }))
            }, _initLYChart_new: function (e, t, l) {
                var a = this, i = "新增确诊";
                "0" == t && (i = "新增确诊"), "1" == t && (i = "新增疑似"), "2" == t && (i = "新增死亡");
                var n = a.sortByKey_new(l, i), r = "";
                r += '<div style="display:flex;text-align: center;">', r += '<div style="flex:2;padding:7px 0;color:white;font-size:0.16rem;">排名</div>', r += '<div style="flex:2;padding:7px 0;color:white;font-size:0.16rem;">省份</div>', r += '<div style="flex:2;padding:7px 0;color:white;cursor:pointer;font-size:0.16rem;" id="quezhenClick">确诊<img id="quezhenSort" src="./img/logo/排序-选中.png"/></div>', r += '<div style="flex:2;padding:7px 0;color:white;cursor:pointer;font-size:0.16rem;" id="yisiClick">疑似<img id="yisiSort" src="./img/logo/排序-未选中.png"/></div>', r += '<div style="flex:2;padding:7px 0;color:white;cursor:pointer;font-size:0.16rem;" id="siwangClick">死亡<img id="siwangSort" src="./img/logo/排序-未选中.png"/></div>', r += "</div>", $.each(n, (function (e, t) {
                    r += '<div style="display:flex;text-align: center; font-size:0.14rem">', r += e < 5 ? '<div style="flex:2;padding:4% 0;color:white;border-radius:50%;"><span style="display:block;width:35%;margin:0 auto;border-radius:50%;background-color:#0091FF;">' + (e + 1) + "</span></div>" : '<div style="flex:2;padding:4% 0;color:#999;border-radius:50%;"><span style="display:block;width:35%;margin:0 auto;border-radius:50%;background-color:#636265;color:white;">' + (e + 1) + "</span></div>", r += '<div style="flex:2;padding:4% 0;color:white">' + o(t.省份) + "</div>", r += '<div style="flex:2;padding:4% 0;color:#999"><span style="display:block;width:50%;margin:0 auto;border-radius:40%;background-color:#777678;color:white;">' + t["新增确诊"] + "</span></div>", r += '<div style="flex:2;padding:4% 0;color:#999"><span style="display:block;width:50%;margin:0 auto;border-radius:40%;background-color:#777678;color:white;">' + t["新增疑似"] + "</span></div>", r += '<div style="flex:2;padding:4% 0;color:#999"><span style="display:block;width:50%;margin:0 auto;border-radius:40%;background-color:#777678;color:white;">' + t["新增死亡"] + "</span></div>", r += "</div>"
                })), $("#" + e).html(r), $("#quezhenClick").click((function () {
                    a._initLYChart_new("sort10", "0", l), $("#quezhenSort").attr("src", "./img/logo/排序-选中.png"), $("#yisiSort").attr("src", "./img/logo/排序-未选中.png"), $("#siwangSort").attr("src", "./img/logo/排序-未选中.png")
                })), $("#yisiClick").click((function () {
                    a._initLYChart_new("sort10", "1", l), $("#quezhenSort").attr("src", "./img/logo/排序-未选中.png"), $("#yisiSort").attr("src", "./img/logo/排序-选中.png"), $("#siwangSort").attr("src", "./img/logo/排序-未选中.png")
                })), $("#siwangClick").click((function () {
                    a._initLYChart_new("sort10", "2", l), $("#quezhenSort").attr("src", "./img/logo/排序-未选中.png"), $("#yisiSort").attr("src", "./img/logo/排序-未选中.png"), $("#siwangSort").attr("src", "./img/logo/排序-选中.png")
                }))
            }, getSum: function (e) {
                var t = 0, l = 0, a = 0;
                return e.forEach((function (e) {
                    t += e["新增确诊"], l += e["新增疑似"], a += e["新增死亡"]
                })), {quezhen: t, yisi: l, siwang: a}
            }, sortByKey_new: function (e, t) {
                return e.sort((function (e, l) {
                    var a = parseInt(e[t]), i = parseInt(l[t]);
                    return a > i ? -1 : a < i ? 1 : 0
                }))
            }
        }, r = {
            classRenderer: {
                type: "class-breaks",
                field: "累计确诊",
                classBreakInfos: [{
                    minValue: 0,
                    maxValue: 0,
                    symbol: {
                        type: "simple-fill",
                        color: [255, 255, 190, .8],
                        style: "solid",
                        outline: {color: [110, 110, 110], width: .4}
                    },
                    label: "无确诊病例"
                }, {
                    minValue: 1,
                    maxValue: 9,
                    symbol: {
                        type: "simple-fill",
                        color: [255, 255, 128, .8],
                        style: "solid",
                        outline: {color: [115, 76, 0], width: .4}
                    },
                    label: "确诊病例<10"
                }, {
                    minValue: 10,
                    maxValue: 99,
                    symbol: {
                        type: "simple-fill",
                        color: [250, 209, 85, .8],
                        style: "solid",
                        outline: {color: [115, 76, 0], width: .4}
                    },
                    label: "确诊病例<100"
                }, {
                    minValue: 100,
                    maxValue: 199,
                    symbol: {
                        type: "simple-fill",
                        color: [242, 167, 46, .8],
                        style: "solid",
                        outline: {color: [115, 76, 0], width: .4}
                    },
                    label: "确诊病例<200"
                }, {
                    minValue: 200,
                    maxValue: 499,
                    symbol: {
                        type: "simple-fill",
                        color: [173, 83, 19, .8],
                        style: "solid",
                        outline: {color: [115, 76, 0], width: .4}
                    },
                    label: "确诊病例<500"
                }, {
                    minValue: 500,
                    maxValue: 1e4,
                    symbol: {
                        type: "simple-fill",
                        color: [107, 0, 0, .8],
                        style: "solid",
                        outline: {color: [115, 76, 0], width: .4}
                    },
                    label: "确诊病例≥500"
                }]
            },
            quezhenNewRenderer: {
                type: "class-breaks",
                field: "新增确诊",
                classBreakInfos: [{
                    minValue: 0,
                    maxValue: 0,
                    symbol: {
                        type: "simple-fill",
                        color: [247, 247, 240, .5],
                        style: "solid",
                        outline: {color: [255, 235, 175], width: .4}
                    },
                    label: "无新增确诊"
                }, {
                    minValue: 1,
                    maxValue: 9,
                    symbol: {
                        type: "simple-fill",
                        color: [255, 255, 190, .5],
                        style: "solid",
                        outline: {color: [255, 235, 175], width: .4}
                    },
                    label: "新增确诊病例<10"
                }, {
                    minValue: 10,
                    maxValue: 29,
                    symbol: {
                        type: "simple-fill",
                        color: [255, 255, 115, .5],
                        style: "solid",
                        outline: {color: [255, 235, 175], width: .4}
                    },
                    label: "新增确诊病例<30"
                }, {
                    minValue: 30,
                    maxValue: 59,
                    symbol: {
                        type: "simple-fill",
                        color: [255, 170, 0, .5],
                        style: "solid",
                        outline: {color: [255, 235, 175], width: .4}
                    },
                    label: "新增确诊病例<60"
                }, {
                    minValue: 60,
                    maxValue: 99,
                    symbol: {
                        type: "simple-fill",
                        color: [255, 85, 0, .5],
                        style: "solid",
                        outline: {color: [255, 235, 175], width: .4}
                    },
                    label: "新增确诊病例<100"
                }, {
                    minValue: 100,
                    maxValue: 1e4,
                    symbol: {
                        type: "simple-fill",
                        color: [247, 0, 0, .5],
                        style: "solid",
                        outline: {color: [255, 235, 175], width: .4}
                    },
                    label: "新增确诊病例≥500"
                }]
            },
            siwangSumRenderer: {
                type: "class-breaks",
                field: "累计死亡",
                classBreakInfos: [{
                    minValue: 0,
                    maxValue: 0,
                    symbol: {
                        type: "simple-fill",
                        color: [188, 214, 235, .5],
                        style: "solid",
                        outline: {color: [116, 151, 179], width: .4}
                    },
                    label: "无累计死亡病例"
                }, {
                    minValue: 1,
                    maxValue: 9,
                    symbol: {
                        type: "simple-fill",
                        color: [49, 174, 218, .5],
                        style: "solid",
                        outline: {color: [115, 223, 255], width: .4}
                    },
                    label: "累计死亡病例<10"
                }, {
                    minValue: 10,
                    maxValue: 1e3,
                    symbol: {
                        type: "simple-fill",
                        color: [0, 86, 94, .5],
                        style: "solid",
                        outline: {color: [0, 169, 230], width: .4}
                    },
                    label: "累计死亡病例≥10"
                }]
            },
            template: {
                title: "{省份}疫情情况",
                content: [{
                    type: "fields",
                    fieldInfos: [{fieldName: "新增疑似"}, {
                        fieldName: "累计疑似",
                        label: "现有疑似"
                    }, {fieldName: "新增确诊"}, {fieldName: "累计确诊"}, {fieldName: "新增死亡"}, {fieldName: "累计死亡"}]
                }]
            }
        }, s = {
            _initBottomPart_new: function (e) {
                var t = [], l = [[], [], [], [], [], []];
                if (a.useJson) {
                    a.jsonData.weekDataName.forEach((function (e) {
                        t.push(e.slice(7, 9) + "月" + e.slice(9, 11) + "日")
                    }));
                    for (var i = 0; i < a.jsonData.weekDataName.length; i++) l[0].push(e[i].新增确诊), l[1].push(e[i].新增疑似), l[2].push(e[i].新增死亡), l[3].push(e[i].累计确诊), l[4].push(e[i].累计疑似), l[5].push(e[i].累计死亡)
                } else {
                    var o = this.handleJsonData(a.jsonData.weekData);
                    t = o.weekDate, l = o.tempData
                }
                this.createBottomChart("全国病例统计", t, l)
            }, handleJsonData: function (e) {
                var t = [], l = [[], [], [], [], [], []];
                return e.forEach((function (e) {
                    t.push(e.日期), l[0].push(e.新增确诊), l[1].push(e.新增疑似), l[2].push(e.新增死亡), l[3].push(e.累计确诊), l[4].push(e.累计疑似), l[5].push(e.累计死亡)
                })), {weekDate: t, tempData: l}
            }, createBottomChart: function (e, t, a) {
                var i = document.getElementById("bottomContent"), o = echarts.init(i, "dark"), n = {
                    title: {text: e, textStyle: {fontSize: 22, color: "white"}, top: 2},
                    tooltip: {trigger: "axis"},
                    color: ["rgb(224, 32, 32)", "rgb(255,242,104)", "rgb(84,151,211)", "rgb(245, 98, 98)", "rgb(255,193,0)", "rgb(127,127,127)"],
                    legend: {
                        data: [{name: "新增确诊", textStyle: {color: "rgb(224, 32, 32)"}}, {
                            name: "新增疑似",
                            textStyle: {fontSize: "0.14rem", color: "rgb(255,242,104)"}
                        }, {name: "新增死亡", textStyle: {color: "rgb(84,151,211)"}}, {
                            name: "累计确诊",
                            textStyle: {color: "rgb(245, 98, 98)"}
                        }, {name: "现有疑似", textStyle: {color: "rgb(255,193,0)"}}, {
                            name: "累计死亡",
                            textStyle: {color: "rgb(127,127,127)"}
                        }],
                        textStyle: {color: "white"},
                        top: 15,
                        selected: {"新增确诊": !0, "新增疑似": !0, "新增死亡": !1, "累计确诊": !1, "现有疑似": !1, "累计死亡": !1}
                    },
                    grid: {left: "3%", right: "4%", bottom: "3%", containLabel: !0},
                    xAxis: {
                        type: "category",
                        boundaryGap: !1,
                        splitLine: {show: !1, lineStyle: {color: "#656163"}},
                        axisLabel: {textStyle: {color: "white"}},
                        axisLine: {lineStyle: {color: "white"}},
                        data: t
                    },
                    yAxis: {
                        type: "value",
                        splitLine: {lineStyle: {type: "dashed"}},
                        axisLabel: {textStyle: {color: "white"}},
                        axisLine: {lineStyle: {color: "white"}}
                    },
                    series: [{
                        name: "新增确诊",
                        type: "line",
                        data: a[0],
                        lineStyle: {color: "rgb(224, 32, 32)"}
                    }, {name: "新增疑似", type: "line", data: a[1], lineStyle: {color: "rgb(255,242,104)"}}, {
                        name: "新增死亡",
                        type: "line",
                        data: a[2],
                        lineStyle: {color: "rgb(84,151,211)"}
                    }, {name: "累计确诊", type: "line", data: a[3], lineStyle: {color: "rgb(245, 98, 98)"}}, {
                        name: "现有疑似",
                        type: "line",
                        data: a[4],
                        lineStyle: {color: "rgb(255,193,0)"}
                    }, {name: "累计死亡", type: "line", data: a[5], lineStyle: {color: "rgb(127,127,127)"}}]
                };
                o.clear(), o.setOption(n), window.mychart = o, o.on("click", (function (e) {
                    Promise.resolve().then((function () {
                        var t = [l(2)];
                        (function (t) {
                            var l = window.view.map.layers.find((function (e) {
                                return "geojsonLyr" === e.title
                            })), a = l.url.substring(0, l.url.length - 9), i = e.name.split("月")[0];
                            parseInt(i) < 10 && (i = "0" + parseInt(i).toString());
                            var o = e.name.split("月")[1].split("日")[0];
                            parseInt(o) < 10 && (o = "0" + parseInt(o).toString());
                            var n = a + i + o + ".json";
                            window.view.map.remove(l);
                            var s = $(".mapTitle").text().slice(13, 17), p = new t({
                                url: n,
                                title: "geojsonLyr",
                                popupTemplate: r.template,
                                renderer: "累计确诊" == s ? r.classRenderer : "累计死亡" == s ? r.siwangSumRenderer : r.quezhenNewRenderer,
                                labelingInfo: [{
                                    labelExpressionInfo: {expression: "$feature.name"},
                                    symbol: {type: "text", color: "black", haloSize: 1, haloColor: "white"}
                                }]
                            });
                            window.view.map.add(p), $(".mapTitle").text($(".mapTitle").text().split("(")[0] + "(" + i + "月" + o + "日)")
                        }).apply(null, t)
                    })).catch(l.oe)
                })), $(window).on("resize", (function (e) {
                    o.resize()
                }))
            }, getCycleData: function (e, t) {
                var l = this, i = t;
                i < a.jsonData.weekDataName.length ? $.get(a.jsonData.url + a.jsonData.weekDataName[i]).done((function (t) {
                    var a = {"新增确诊": 0, "新增疑似": 0, "新增死亡": 0, "累计确诊": 0, "累计疑似": 0, "累计死亡": 0};
                    t.features.forEach((function (e) {
                        a["新增确诊"] += e.properties["新增确诊"], a["新增疑似"] += e.properties["新增疑似"], a["新增死亡"] += e.properties["新增死亡"], a["累计确诊"] += e.properties["累计确诊"], a["累计疑似"] += e.properties["累计疑似"], a["累计死亡"] += e.properties["累计死亡"]
                    })), e.push(a), i++, l.getCycleData(e, i)
                })) : l._initBottomPart_new(e)
            }
        };
        Promise.resolve().then((function () {
            var e = [l(3), l(4), l(5), l(6), l(2), l(7), l(8), l(9), l(10), l(11)];
            (function (e, t, l, i, o, n, p, c, m) {
                var u = new e({basemap: new l({baseLayers: [new i({url: a.mapConfig.basemapUrl})]})}),
                    d = a.mapConfig.zoom;
                document.documentElement.clientWidth <= 1400 && d--;
                var f = new t({container: "viewDiv", map: u, center: a.mapConfig.center, zoom: d});
                window.view = f, f.ui.remove(["attribution", "zoom"]);
                var g = new n({container: document.getElementById("homeBtnContainer"), view: f});
                f.ui.add(g);
                var y = {
                    labelExpressionInfo: {expression: "$feature.省份"},
                    symbol: {type: "text", color: "black", haloSize: 1, haloColor: "white"}
                }, h = new o({
                    url: a.layerConfig.geojsonUrl,
                    title: "geojsonLyr",
                    popupTemplate: r.template,
                    renderer: r.classRenderer,
                    labelingInfo: [y]
                });
                u.add(h);
                var w = new p({view: f, container: document.getElementById("legendContainer")});
                f.ui.add(w), f.watch("zoom", (function (e) {
                    f.zoom > 4 ? h.labelingInfo = [] : h.labelingInfo = [y]
                })), f.on("click", (function (e) {
                    f.hitTest(e).then((function (e) {
                        if (e.results.length) {
                            var t = e.results.filter((function (e) {
                                return "geojsonLyr" === e.graphic.layer.title
                            }))[0].graphic.attributes["省份"], l = a.jsonData.proviceData[t], i = s.handleJsonData(l);
                            s.createBottomChart(t + "病例统计", i.weekDate, i.tempData)
                        }
                    }))
                }));
                var b = !1;
                m.init(f.popup, "visible", (function (e) {
                    e && (b = !0), b && !e && s._initBottomPart_new()
                })), h.when((function () {
                    $(".mapTitle").text("全国新型冠状病毒感染的肺炎累计确诊病例分布图(" + a.dateDisplayConfig.month + "月" + a.dateDisplayConfig.day + "日)"), $("#layerControl").css({display: "block"}), $("#quezhenSum").css({color: "rgba(7, 251, 255, 1)"}), $("#layerControl").click((function () {
                        $("#layerMsg").toggle()
                    })), $("#layerMsg").click((function (e) {
                        u.removeAll();
                        var t = new o({
                            url: a.layerConfig.geojsonUrl,
                            title: "geojsonLyr",
                            popupTemplate: r.template,
                            renderer: r.classRenderer
                        });
                        t.labelingInfo = [y], f.watch("zoom", (function () {
                            f.zoom > 4 ? t.labelingInfo = [] : t.labelingInfo = [y]
                        })), "siwangSum" == e.target.id ? (t.renderer = r.siwangSumRenderer, u.add(t), $("#siwangSum").css({color: "rgba(7, 251, 255, 1)"}), $("#quezhenSum").css({color: "rgba(255, 255, 255, 1)"}), $("#quezhenNew").css({color: "rgba(255, 255, 255, 1)"}), $(".mapTitle").text("全国新型冠状病毒感染的肺炎累计死亡病例分布图(" + a.dateDisplayConfig.month + "月" + a.dateDisplayConfig.day + "日)")) : "quezhenSum" == e.target.id ? (t.renderer = r.classRenderer, u.add(t), $("#siwangSum").css({color: "rgba(255, 255, 255, 1)"}), $("#quezhenSum").css({color: "rgba(7, 251, 255, 1)"}), $("#quezhenNew").css({color: "rgba(255, 255, 255, 1)"}), $(".mapTitle").text("全国新型冠状病毒感染的肺炎累计确诊病例分布图(" + a.dateDisplayConfig.month + "月" + a.dateDisplayConfig.day + "日)")) : "quezhenNew" == e.target.id && (t.renderer = r.quezhenNewRenderer, u.add(t), $("#siwangSum").css({color: "rgba(255, 255, 255, 1)"}), $("#quezhenSum").css({color: "rgba(255, 255, 255, 1)"}), $("#quezhenNew").css({color: "rgba(7, 251, 255, 1)"}), $(".mapTitle").text("全国新型冠状病毒感染的肺炎新增确诊病例分布图(" + a.dateDisplayConfig.month + "月" + a.dateDisplayConfig.day + "日)"))
                    }))
                }))
            }).apply(null, e)
        })).catch(l.oe), setInterval((function () {
            var e = new Date, t = e.getFullYear(), l = e.getMonth() + 1, i = e.getDate(), o = e.getDay(),
                n = e.getHours(), r = e.getMinutes(), s = e.getSeconds(), p = l < 10 ? "0" + l : l,
                c = i < 10 ? "0" + i : i, m = n < 10 ? "0" + n : n, u = r < 10 ? "0" + r : r, d = s < 10 ? "0" + s : s;
            $("#date").text(t + " " + p + " " + c + " " + ["星期天", "星期一", "星期二", "星期三", "星期四", "星期五", "星期六"][o]), $("#textTime1").text("".concat(a.dateDisplayConfig.month, "月").concat(a.dateDisplayConfig.day, "日")), $("#textTime2").text("".concat(a.dateDisplayConfig.month, "月").concat(a.dateDisplayConfig.day, "日")), $("#time1").text("".concat(a.dateDisplayConfig.month, "月").concat(a.dateDisplayConfig.day, "日0-24时")), $("#time2").text("".concat(a.dateDisplayConfig.month, "月").concat(a.dateDisplayConfig.day, "日0-24时")), $("#titleTime").text("".concat(a.dateDisplayConfig.month, "月").concat(a.dateDisplayConfig.day, "日"));
            var f = "";
            f = f + '<span style="float:left">' + m + "</span>", f = (f += '<span id="online" style="width:16px; display:block; float:left">: </span>') + '<span style="float:left">' + u + "</span>", f = (f += '<span id="online2" style="width:16px; display:block; float:left">: </span>') + '<span style="float:left">' + d + "</span>", $("#clock").html(f)
        }), 1e3);
        var p = null, c = 0;
        $("#autoplay").click((function () {
            $("#autoplay").css("display", "none"), $("#suspend").css("display", "flex"), p = setInterval((function () {
                Promise.resolve().then((function () {
                    var e = [l(2)];
                    (function (e) {
                        var t = window.view.map.layers.find((function (e) {
                            return "geojsonLyr" === e.title
                        }));
                        window.view.map.remove(t), window.view.map.removeAll();
                        var l, i, o = $(".mapTitle").text().slice(13, 17);
                        l = "累计确诊" == o ? r.classRenderer : "累计死亡" == o ? r.siwangSumRenderer : r.quezhenNewRenderer;
                        var n = a.jsonData.weekDataName[c].slice(7, 9), s = a.jsonData.weekDataName[c].slice(9, 11);
                        if (a.useJson) i = new e({
                            url: a.jsonData.url + a.jsonData.weekDataName[c],
                            title: "geojsonLyr",
                            popupTemplate: r.template,
                            renderer: l
                        }); else {
                            var m = a.jsonData.weekData[c].日期;
                            n = m.split("月")[0], parseInt(n) < 10 && (n = "0" + n.toString()), s = m.split("月")[1].split("日")[0], parseInt(s) < 10 && (s = "0" + s.toString()), i = new e({
                                url: a.jsonData.url + "yq_2020" + n + s + ".json",
                                title: "geojsonLyr",
                                popupTemplate: r.template,
                                renderer: l
                            })
                        }
                        i.labelingInfo = [{
                            labelExpressionInfo: {expression: "$feature.省份"},
                            symbol: {type: "text", color: "black", haloSize: 1, haloColor: "white"}
                        }], window.view.map.add(i), $(".mapTitle").text($(".mapTitle").text().split("(")[0] + "(" + n + "月" + s + "日)"), window.mychart.dispatchAction({
                            type: "showTip",
                            seriesIndex: "1",
                            dataIndex: c
                        }), c === a.jsonData.weekDataName.length - 1 && (c = 0, clearInterval(p), $("#autoplay").css("display", "flex"), $("#suspend").css("display", "none")), c++
                    }).apply(null, e)
                })).catch(l.oe)
            }), 5500)
        })), $("#suspend").click((function () {
            $("#autoplay").css("display", "flex"), $("#suspend").css("display", "none"), clearInterval(p)
        }));
        var m = echarts.init(document.getElementById("rightChartContainer"), "dark");
        $.getJSON(a.layerConfig.geojsonUrl).done((function (e) {
            var t = e.features.map((function (e) {
                return e.properties.省份
            }));
            t = t.map((function (e) {
                return o(e)
            }));
            var l = e.features.map((function (e) {
                return e.properties.累计疑似
            })), a = e.features.map((function (e) {
                return e.properties.累计确诊
            })), i = e.features.map((function (e) {
                return e.properties.累计死亡
            })), n = {
                tooltip: {trigger: "axis", axisPointer: {type: "shadow"}},
                legend: {data: ["累计确诊", "现有疑似", "累计死亡"], textStyle: {fontSize: "0.14rem"}},
                grid: {left: "3%", right: "4%", bottom: "0", containLabel: !0},
                xAxis: {type: "value", max: 1e3, splitLine: {show: !1}},
                yAxis: {type: "category", data: t.reverse(), splitLine: {show: !1}},
                series: [{
                    name: "累计确诊",
                    type: "bar",
                    stack: "累计",
                    label: {position: "inside"},
                    data: a.reverse()
                }, {
                    name: "现有疑似",
                    type: "bar",
                    stack: "累计",
                    label: {position: "inside"},
                    data: l.reverse()
                }, {name: "累计死亡", type: "bar", stack: "累计", label: {position: "inside"}, data: i.reverse()}]
            };
            m.setOption(n)
        })), $(window).resize((function () {
            m.resize()
        })), a.useJson ? $.getJSON(a.layerConfig.geojsonUrl).done((function (e) {
            var t = 0, l = 0, a = 0;
            e.features.map((function (e) {
                t += e.properties.累计确诊, l += e.properties.累计疑似, a += e.properties.累计死亡
            })), $("#quezhenNum").text(t), $("#yisiNum").text(l), $("#siwangNum").text(a)
        })) : ($("#quezhenNum").text(a.quezhenSum), $("#yisiNum").text(a.yisiSum), $("#siwangNum").text(a.siwangSum));
        var u = [];
        $.get(a.jsonData.url + a.jsonData.dataName).done((function (e) {
            e.features.forEach((function (e) {
                u.push(e.properties)
            })), n._initLeftPart_new(u)
        })), a.useJson ? s.getCycleData([], 0) : s._initBottomPart_new()
    }, function (t, l) {
        t.exports = e
    }, function (e, l) {
        e.exports = t
    }, function (e, t) {
        e.exports = l
    }, function (e, t) {
        e.exports = a
    }, function (e, t) {
        e.exports = i
    }, function (e, t) {
        e.exports = o
    }, function (e, t) {
        e.exports = n
    }, function (e, t) {
        e.exports = r
    }, function (e, t) {
        e.exports = s
    }, function (e, t) {
        e.exports = p
    }])
}));